###############################################################################
# Created by write_sdc
# Fri Nov  5 09:51:10 2021
###############################################################################
current_design gpio_defaults_block_0403
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 10.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__