### RAM 256 Signoff SDC
### Rev 1
### Date: 9/10/2022

###############################################################################
# Timing Constraints
###############################################################################
create_clock -name CLK -period 25.0000 [get_ports {CLK}]
set_clock_transition 0.1500 [get_clocks {CLK}]
set_clock_uncertainty 0.1000 CLK
set_propagated_clock [get_clocks {CLK}]

set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[0]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[1]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[2]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[3]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[4]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[5]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[6]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[0]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[10]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[11]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[12]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[13]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[14]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[15]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[16]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[17]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[18]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[19]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[1]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[20]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[21]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[22]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[23]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[24]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[25]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[26]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[27]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[28]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[29]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[2]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[30]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[31]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[3]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[4]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[5]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[6]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[7]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[8]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[9]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {EN0}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WE0[0]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WE0[1]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WE0[2]}]
set_input_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WE0[3]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[0]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[10]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[11]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[12]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[13]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[14]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[15]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[16]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[17]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[18]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[19]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[1]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[20]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[21]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[22]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[23]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[24]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[25]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[26]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[27]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[28]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[29]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[2]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[30]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[31]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[3]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[4]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[5]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[6]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[7]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[8]}]
set_output_delay 1.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1500 [get_ports {Do0[31]}]
set_load -pin_load 0.1500 [get_ports {Do0[30]}]
set_load -pin_load 0.1500 [get_ports {Do0[29]}]
set_load -pin_load 0.1500 [get_ports {Do0[28]}]
set_load -pin_load 0.1500 [get_ports {Do0[27]}]
set_load -pin_load 0.1500 [get_ports {Do0[26]}]
set_load -pin_load 0.1500 [get_ports {Do0[25]}]
set_load -pin_load 0.1500 [get_ports {Do0[24]}]
set_load -pin_load 0.1500 [get_ports {Do0[23]}]
set_load -pin_load 0.1500 [get_ports {Do0[22]}]
set_load -pin_load 0.1500 [get_ports {Do0[21]}]
set_load -pin_load 0.1500 [get_ports {Do0[20]}]
set_load -pin_load 0.1500 [get_ports {Do0[19]}]
set_load -pin_load 0.1500 [get_ports {Do0[18]}]
set_load -pin_load 0.1500 [get_ports {Do0[17]}]
set_load -pin_load 0.1500 [get_ports {Do0[16]}]
set_load -pin_load 0.1500 [get_ports {Do0[15]}]
set_load -pin_load 0.1500 [get_ports {Do0[14]}]
set_load -pin_load 0.1500 [get_ports {Do0[13]}]
set_load -pin_load 0.1500 [get_ports {Do0[12]}]
set_load -pin_load 0.1500 [get_ports {Do0[11]}]
set_load -pin_load 0.1500 [get_ports {Do0[10]}]
set_load -pin_load 0.1500 [get_ports {Do0[9]}]
set_load -pin_load 0.1500 [get_ports {Do0[8]}]
set_load -pin_load 0.1500 [get_ports {Do0[7]}]
set_load -pin_load 0.1500 [get_ports {Do0[6]}]
set_load -pin_load 0.1500 [get_ports {Do0[5]}]
set_load -pin_load 0.1500 [get_ports {Do0[4]}]
set_load -pin_load 0.1500 [get_ports {Do0[3]}]
set_load -pin_load 0.1500 [get_ports {Do0[2]}]
set_load -pin_load 0.1500 [get_ports {Do0[1]}]
set_load -pin_load 0.1500 [get_ports {Do0[0]}]
