
===========================================================================
report_parasitic_annotation -report_unannotated
============================================================================
Found 0 unannotated nets.
Found 0 partially unannotated nets.
parastic_annotation_check
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          0.00e+00   0.00e+00   1.10e-10   1.10e-10 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  0.00e+00   0.00e+00   1.10e-10   1.10e-10 100.0%
                           0.0%       0.0%     100.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 26 u^2 8% utilization.
area_report_end
Setting global connections for newly added cells...
[WARNING] Did not save OpenROAD database!
Writing SDF to /home/hosni/caravel_sky130/caravel/openlane/gpio_logic_high/runs/23_01_31_05_32/results/routing/mca/process_corner_nom/gpio_logic_high.sdf...
Writing timing model to /home/hosni/caravel_sky130/caravel/openlane/gpio_logic_high/runs/23_01_31_05_32/results/routing/mca/process_corner_nom/gpio_logic_high.lib...

